load-test/results/smoke.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * dashboard_readers: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m00.9s), 10/10 VUs, 0 complete and 0 interrupted iterations
dashboard_readers   [   2% ] 10 VUs  0m00.9s/1m0s

running (0m01.9s), 10/10 VUs, 0 complete and 0 interrupted iterations
dashboard_readers   [   3% ] 10 VUs  0m01.9s/1m0s

running (0m02.9s), 10/10 VUs, 0 complete and 0 interrupted iterations
dashboard_readers   [   5% ] 10 VUs  0m02.9s/1m0s

running (0m03.9s), 10/10 VUs, 0 complete and 0 interrupted iterations
dashboard_readers   [   7% ] 10 VUs  0m03.9s/1m0s

running (0m04.9s), 10/10 VUs, 0 complete and 0 interrupted iterations
dashboard_readers   [   8% ] 10 VUs  0m04.9s/1m0s

running (0m05.9s), 10/10 VUs, 10 complete and 0 interrupted iterations
dashboard_readers   [  10% ] 10 VUs  0m05.9s/1m0s

running (0m06.9s), 10/10 VUs, 10 complete and 0 interrupted iterations
dashboard_readers   [  12% ] 10 VUs  0m06.9s/1m0s

running (0m07.9s), 10/10 VUs, 10 complete and 0 interrupted iterations
dashboard_readers   [  13% ] 10 VUs  0m07.9s/1m0s

running (0m08.9s), 10/10 VUs, 10 complete and 0 interrupted iterations
dashboard_readers   [  15% ] 10 VUs  0m08.9s/1m0s

running (0m09.9s), 10/10 VUs, 19 complete and 0 interrupted iterations
dashboard_readers   [  17% ] 10 VUs  0m09.9s/1m0s

running (0m10.9s), 10/10 VUs, 20 complete and 0 interrupted iterations
dashboard_readers   [  18% ] 10 VUs  0m10.9s/1m0s

running (0m11.9s), 10/10 VUs, 20 complete and 0 interrupted iterations
dashboard_readers   [  20% ] 10 VUs  0m11.9s/1m0s

running (0m12.9s), 10/10 VUs, 20 complete and 0 interrupted iterations
dashboard_readers   [  22% ] 10 VUs  0m12.9s/1m0s

running (0m13.9s), 10/10 VUs, 23 complete and 0 interrupted iterations
dashboard_readers   [  23% ] 10 VUs  0m13.9s/1m0s

running (0m14.9s), 10/10 VUs, 30 complete and 0 interrupted iterations
dashboard_readers   [  25% ] 10 VUs  0m14.9s/1m0s

running (0m15.9s), 10/10 VUs, 30 complete and 0 interrupted iterations
dashboard_readers   [  27% ] 10 VUs  0m15.9s/1m0s

running (0m16.9s), 10/10 VUs, 30 complete and 0 interrupted iterations
dashboard_readers   [  28% ] 10 VUs  0m16.9s/1m0s

running (0m17.9s), 10/10 VUs, 30 complete and 0 interrupted iterations
dashboard_readers   [  30% ] 10 VUs  0m17.9s/1m0s

running (0m18.9s), 10/10 VUs, 40 complete and 0 interrupted iterations
dashboard_readers   [  32% ] 10 VUs  0m18.9s/1m0s

running (0m19.9s), 10/10 VUs, 40 complete and 0 interrupted iterations
dashboard_readers   [  33% ] 10 VUs  0m19.9s/1m0s

running (0m20.9s), 10/10 VUs, 40 complete and 0 interrupted iterations
dashboard_readers   [  35% ] 10 VUs  0m20.9s/1m0s

running (0m21.9s), 10/10 VUs, 40 complete and 0 interrupted iterations
dashboard_readers   [  37% ] 10 VUs  0m21.9s/1m0s

running (0m22.9s), 10/10 VUs, 50 complete and 0 interrupted iterations
dashboard_readers   [  38% ] 10 VUs  0m22.9s/1m0s

running (0m23.9s), 10/10 VUs, 50 complete and 0 interrupted iterations
dashboard_readers   [  40% ] 10 VUs  0m23.9s/1m0s

running (0m24.9s), 10/10 VUs, 50 complete and 0 interrupted iterations
dashboard_readers   [  42% ] 10 VUs  0m24.9s/1m0s

running (0m25.9s), 10/10 VUs, 50 complete and 0 interrupted iterations
dashboard_readers   [  43% ] 10 VUs  0m25.9s/1m0s

running (0m26.9s), 10/10 VUs, 54 complete and 0 interrupted iterations
dashboard_readers   [  45% ] 10 VUs  0m26.9s/1m0s

running (0m27.9s), 10/10 VUs, 60 complete and 0 interrupted iterations
dashboard_readers   [  47% ] 10 VUs  0m27.9s/1m0s

running (0m28.9s), 10/10 VUs, 60 complete and 0 interrupted iterations
dashboard_readers   [  48% ] 10 VUs  0m28.9s/1m0s

running (0m29.9s), 10/10 VUs, 60 complete and 0 interrupted iterations
dashboard_readers   [  50% ] 10 VUs  0m29.9s/1m0s

running (0m30.9s), 10/10 VUs, 60 complete and 0 interrupted iterations
dashboard_readers   [  52% ] 10 VUs  0m30.9s/1m0s

running (0m31.9s), 10/10 VUs, 70 complete and 0 interrupted iterations
dashboard_readers   [  53% ] 10 VUs  0m31.9s/1m0s

running (0m32.9s), 10/10 VUs, 70 complete and 0 interrupted iterations
dashboard_readers   [  55% ] 10 VUs  0m32.9s/1m0s

running (0m33.9s), 10/10 VUs, 70 complete and 0 interrupted iterations
dashboard_readers   [  57% ] 10 VUs  0m33.9s/1m0s

running (0m34.9s), 10/10 VUs, 70 complete and 0 interrupted iterations
dashboard_readers   [  58% ] 10 VUs  0m34.9s/1m0s

running (0m35.9s), 10/10 VUs, 79 complete and 0 interrupted iterations
dashboard_readers   [  60% ] 10 VUs  0m35.9s/1m0s

running (0m36.9s), 10/10 VUs, 80 complete and 0 interrupted iterations
dashboard_readers   [  62% ] 10 VUs  0m36.9s/1m0s

running (0m37.9s), 10/10 VUs, 80 complete and 0 interrupted iterations
dashboard_readers   [  63% ] 10 VUs  0m37.9s/1m0s

running (0m38.9s), 10/10 VUs, 80 complete and 0 interrupted iterations
dashboard_readers   [  65% ] 10 VUs  0m38.9s/1m0s

running (0m39.9s), 10/10 VUs, 84 complete and 0 interrupted iterations
dashboard_readers   [  67% ] 10 VUs  0m39.9s/1m0s

running (0m40.9s), 10/10 VUs, 90 complete and 0 interrupted iterations
dashboard_readers   [  68% ] 10 VUs  0m40.9s/1m0s

running (0m41.9s), 10/10 VUs, 90 complete and 0 interrupted iterations
dashboard_readers   [  70% ] 10 VUs  0m41.9s/1m0s

running (0m42.9s), 10/10 VUs, 90 complete and 0 interrupted iterations
dashboard_readers   [  72% ] 10 VUs  0m42.9s/1m0s

running (0m43.9s), 10/10 VUs, 90 complete and 0 interrupted iterations
dashboard_readers   [  73% ] 10 VUs  0m43.9s/1m0s

running (0m44.9s), 10/10 VUs, 100 complete and 0 interrupted iterations
dashboard_readers   [  75% ] 10 VUs  0m44.9s/1m0s

running (0m45.9s), 10/10 VUs, 100 complete and 0 interrupted iterations
dashboard_readers   [  77% ] 10 VUs  0m45.9s/1m0s

running (0m46.9s), 10/10 VUs, 100 complete and 0 interrupted iterations
dashboard_readers   [  78% ] 10 VUs  0m46.9s/1m0s

running (0m47.9s), 10/10 VUs, 100 complete and 0 interrupted iterations
dashboard_readers   [  80% ] 10 VUs  0m47.9s/1m0s

running (0m48.9s), 10/10 VUs, 107 complete and 0 interrupted iterations
dashboard_readers   [  82% ] 10 VUs  0m48.9s/1m0s

running (0m49.9s), 10/10 VUs, 110 complete and 0 interrupted iterations
dashboard_readers   [  83% ] 10 VUs  0m49.9s/1m0s

running (0m50.9s), 10/10 VUs, 110 complete and 0 interrupted iterations
dashboard_readers   [  85% ] 10 VUs  0m50.9s/1m0s

running (0m51.9s), 10/10 VUs, 110 complete and 0 interrupted iterations
dashboard_readers   [  87% ] 10 VUs  0m51.9s/1m0s

running (0m52.9s), 10/10 VUs, 113 complete and 0 interrupted iterations
dashboard_readers   [  88% ] 10 VUs  0m52.9s/1m0s

running (0m53.9s), 10/10 VUs, 120 complete and 0 interrupted iterations
dashboard_readers   [  90% ] 10 VUs  0m53.9s/1m0s

running (0m54.9s), 10/10 VUs, 120 complete and 0 interrupted iterations
dashboard_readers   [  92% ] 10 VUs  0m54.9s/1m0s

running (0m55.9s), 10/10 VUs, 120 complete and 0 interrupted iterations
dashboard_readers   [  93% ] 10 VUs  0m55.9s/1m0s

running (0m56.9s), 10/10 VUs, 120 complete and 0 interrupted iterations
dashboard_readers   [  95% ] 10 VUs  0m56.9s/1m0s

running (0m57.9s), 10/10 VUs, 129 complete and 0 interrupted iterations
dashboard_readers   [  97% ] 10 VUs  0m57.9s/1m0s

running (0m58.9s), 10/10 VUs, 130 complete and 0 interrupted iterations
dashboard_readers   [  98% ] 10 VUs  0m58.9s/1m0s

running (0m59.9s), 10/10 VUs, 130 complete and 0 interrupted iterations
dashboard_readers   [ 100% ] 10 VUs  0m59.9s/1m0s

running (1m00.9s), 10/10 VUs, 130 complete and 0 interrupted iterations
dashboard_readers ↓ [ 100% ] 10 VUs  1m0s

running (1m01.9s), 03/10 VUs, 137 complete and 0 interrupted iterations
dashboard_readers ↓ [ 100% ] 10 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=217.3ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 560     8.988795/s
    checks_succeeded...: 100.00% 560 out of 560
    checks_failed......: 0.00%   0 out of 560

    ✓ stats 200
    ✓ deliveries 200
    ✓ endpoints 200
    ✓ session seeded with demo endpoint

    HTTP
    http_req_duration..............: avg=127.94ms min=90.6ms med=106.78ms max=848.22ms p(90)=141.93ms p(95)=217.3ms
      { expected_response:true }...: avg=127.94ms min=90.6ms med=106.78ms max=848.22ms p(90)=141.93ms p(95)=217.3ms
    http_req_failed................: 0.00%  0 out of 420
    http_reqs......................: 420    6.741596/s

    EXECUTION
    iteration_duration.............: avg=4.4s     min=4.29s  med=4.32s    max=5.63s    p(90)=4.48s    p(95)=4.97s  
    iterations.....................: 140    2.247199/s
    vus............................: 3      min=3        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 209 kB 3.4 kB/s
    data_sent......................: 39 kB  625 B/s



running (1m02.3s), 00/10 VUs, 140 complete and 0 interrupted iterations
dashboard_readers ✓ [ 100% ] 10 VUs  1m0s